
* ob-lilypond
** Stages
*** DONE Get something working ish! 
*** DONE Get in Github
*** DONE Decide directory Structure
*** DONE Decide LilyPond-mode and lilypond-hook integration wrt ob-lilypond
Use seperate hook in ob-lilypond to auto draw / play under preferences
*** DONE Get correct basename on build files
*** TODO Decide How to handle OS dependencies
 - midi player
 - pdf viewer
 - LilyPond location
 - LilyPond API (OSX needs special treatment at the very least
** Setup
*** Add dev switch hook

#+BEGIN_SRC emacs-lisp
  
  (defun ob-lilypond-switch-src-control-file()
    "Fast route to ob-lilypond.org and back"
    (interactive)
    (let ((project-file 
           (concat dotfiles-dir
                   "martyn/martyn/ob-lilypond/dev/ob-lilypond.org"))
          (buffer))
      (unless (boundp 'me-last-buffer)
              (setq me-last-buffer
                    (concat dotfiles-dir
                            "martyn/martyn/ob-lilypond/lib/ob-lilypond.el")))
      (if (equal (buffer-file-name) project-file)
          (setq buffer me-last-buffer)
        (setq me-last-buffer (buffer-file-name))
        (setq buffer project-file))
      (message (concat "Switching to " buffer))
      (switch-to-buffer  (file-name-nondirectory buffer))))
  (global-set-key [f4] 'ob-lilypond-switch-src-control-file)
    
#+END_SRC
#+results:
: ob-lilypond-switch-src-control-file

*** Add Continuous Testing hook

#+BEGIN_SRC emacs-lisp
  
  (defun ob-lilypond-eval-src-and-tests ()
    (interactive)
    (let ((original-buffer buffer-file-name)
          (original-window (selected-window)))
      (if(string-match "^ob-lilypond" (file-name-nondirectory original-buffer)) 
          (progn
            (eval-buffer "ob-lilypond-tests.el")
            (eval-buffer "ob-lilypond.el")
            (ert t)))
      (select-window original-window)))
  
(add-hook 'after-save-hook 'ob-lilypond-eval-src-and-tests)

#+END_SRC

#+results:
| ob-lilypond-eval-src-and-tests |

*** Remove Continuous Testing Hook

#+BEGIN_SRC emacs-lisp
  
(remove-hook 'after-save-hook 'ob-lilypond-eval-src-and-tests)

#+END_SRC

*** Setup Dev Project

#+BEGIN_SRC emacs-lisp (windows)

  (defun lilypond-project ()
    (interactive)
    (when (fboundp 'unity-mode)
      (unload-feature 'unity-mode t))
    (when (fboundp 'unity-mode-tests)
      (unload-feature 'unity-mode-tests t))
    (add-to-list 'load-path
                 (concat dotfiles-dir  "martyn/martyn/ob-lilypond"))
    (delete-other-windows)
    (split-window-horizontally)
    (windmove-right)
    (find-file "~/.emacs.d/martyn/martyn/ob-lilypond/ob-lilypond.el")
    (windmove-left)
    (find-file "~/.emacs.d/martyn/martyn/ob-lilypond/ob-lilypond-tests.el")
    (switch-to-buffer "ob-lilypond-tests.el")
    (split-window-vertically)
    (switch-to-buffer "*ert*")
    (windmove-down)
    (switch-to-buffer "ob-lilypond-tests.el"))
  
#+END_SRC
#+results:
: lilypond-project


    
